#+TITLE: TRFKACD (The Repo Formerly Known As CormacC's Dotfiles)
#+AUTHOR: Cormac Cannon
#+EMAIL: cormacc@gmail.com
#+LANGUAGE: en
#+COPYRIGHT: Cormac Cannon, 2023-2026
#+DATE: 2026-04-28

# HTML EXPORT SETUP
# 1. Apply a theme
#+SETUPFILE: ~/Documents/templates/org-html-themes/org/theme-readtheorg.setup

# 2. Ensure exports include both source block contents and any results
#+PROPERTY: header-args :exports both

# 3. Specify styles for ODT (and DOCX) export

#+ODT_STYLES_FILE: ("~/Documents/templates/nmd-template.odt" ("styles.xml" "content.xml" "Pictures/1000000000000A4F000004650AA167B89A2F5561.jpg"))

# Startup options : Want to view rendered versions of latex fragments (equations etc.) by default
#+STARTUP:: latexpreview


A Nix flake managing my home directory (via Home Manager), a handful of NixOS
hosts, and a macOS system config (via nix-darwin). Daily-driver platform is
Arch Linux + nix + home-manager; NixOS runs on a few machines and nix-darwin
on macOS.

See [[#repository-layout--architecture][Repository layout / architecture]] for the lay of the land, or jump
straight to [[#provisioning-a-new-accountinstallation][Provisioning a new account/installation]] if you're setting up a
fresh machine.

*** List generations
#+begin_src shell
  home-manager generations
#+end_src

#+RESULTS:
: 2023-10-27 00:50 : id 19 -> /nix/store/5h9hisgf0jhygihvkanyvv19dz6s8gv4-home-manager-generation

